// Практическая работа №1
// Использование языка С# для математических расчётов
// Студент группы 414, Богданов Александр Евгеньевич. 2022 год

// Для заданной окружности и луча в 
// плоскости определить, пересекает ли луч
// окружность. 
// Найти координаты точек пересечения.


// Уравнение окружности с центром O(x0, y0): (x-x0)^2+(y-y0)^2 = R^2
// Уравнение прямоя, на которой лежит луч: y=k*x+b
// Уравнение пересечения вектора с окр: p(->)=R/(sqrt(u^2(x)+v^2(y)v

namespace first_lab
{
    public class Interface { }

}

